Tekla Open API Reference for Tekla Structures 2025
Size Methods
Methods
Name | Description
ToString()
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
 (Overrides Object.ToString().)
ToString(String)
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
ToString(IFormatProvider, String)
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
Top
See Also
Reference
Size Class
Tekla.Structures.Drawing Namespace